<template lang='pug'>
.rules-wrap
	.rules-header
	.rules-body
		.rules-item
			.rules-item__title 盤前規則
			.rules-item__content
				ul
					li 不接受市價、限價單、批分單、收盤單、閃電單嚇出指令。
					li 留倉單不接受修改損益獲利點。
		.rules-item
			.rules-item__title 開盤規則
			.rules-item__content
				ul
					li [開盤最大漲跌]：開盤－昨收盤＝最大漲跌點，依據帳號內開盤最大。
					li [每口最大漲跌]：多空單成交後，上下漲跌幅最大[極贏]與[極輸]點數。
					li [風控：禁新]：檢查漲跌幅限制，台股
						span.text-danger 「9%」
						|，輕油
						span.text-danger 「10%」
						|，其他國外商品
						span.text-danger 「5%」
						|觸及後，一律禁止新單。
					li [風控：強平]：檢查漲跌幅限制，台股
						span.text-danger 「10%」
						|，輕油
						span.text-danger 「10%」
						|，其他國外商品
						span.text-danger 「5%」
						|觸及後，一律禁止強平。
					li 市價單開始成交：[不可改價減量及不接收刪單]。
					li 限價單、倒限單開始成交：[可改價減量及接收刪單]。
					li 開始接受修改損失獲利點。
		.rules-item
			.rules-item__title 盤中規則
			.rules-item__content
				ul
					li 台股漲跌幅到達
						span.text-danger 「10%」
						|則進行強制平倉命令，當行情接著降至
						span.text-danger 「9%」
						|以下則可在下新單。
					li 輕油漲跌幅到達
						span.text-danger 「10%」
						|則進行強制平倉命令，當行情接著降至
						span.text-danger 「10%」
						|以下則可在下新單。
					li 其他國外商品漲跌幅到達
						span.text-danger 「5%」
						| 則進行強制平倉命令，當行情接著降至
						span.text-danger 「5%」
						| 以下則可在下新單。
					li 市價單、閃電單：下單後會於報價的下一筆於立即成交，沒最新報價則顯示未成交，(此模式不提供刪單功能)。
					li 限價單：點價成交，若遇穿價以設定之原價位成交，及穿價回原價。
					li 批分價：送出多空單後將於下一分鐘整點00分第一筆報價作為成交價(此模式不提供刪單功能)。
					li 收盤價：送出多空單後將成交在該商品收盤最後一筆報價作為留倉單(請需注意自身該商品留倉口數上線及帳戶餘額)。
					li 閃電下單：下單後會於報價的下一筆於0.2~0.5秒之內成交，沒最新報價則顯示未成交。
					li 收盤全平：打勾後，收盤將會平倉該商品所有在倉部位，此功能在倉單一律全平不遵照自身留倉口數上線。
					li 可於(市價)(限價)單直接指定欲獲利及停損的點數，同步送出。
					li 當帳戶餘額為0，全商品未平倉單系統將強制平倉，掛價單也將一併刪除。
					li 當帳戶餘額為0，則無法在下新單需洽上層補足帳戶餘額後才可繼續交易。
					li 當帳戶餘額為0，所產生的強制平倉單與限價單刪除無法恢復。
		.rules-item
			.rules-item__title 收盤規則
			.rules-item__content
				ul
					li 商品收盤後,將自動刪除所有限價單]恢復帳號初始預設的損失點獲利點,不再接受下單。
					li 市價單會以該商品收盤最後一筆報價成交[昨收盤],並做為下次開盤留意起始價。
					li 限價單如果觸及或是穿越將成交,否系統將會自動刪單。 4.使用買或責收盤價功能,系統將會以收盤最後一筆報價成交。 5. 檢查該商品最大留倉口數及帳戶餘額,進行留倉指令,超過該商品最大留倉口數之單,則強制平倉
						.text-danger 舉例說明:設台指今日損益為0每口留倉預扣為3萬,帳戶餘額為5萬 +未平損益0,全商品可留倉5,單商品可留意2,則留倉1
						.text-danger 舉例說明:設台指今日損益為0每口留倉預扣為3萬,帳戶餘額為6萬 +未平損益0 全商品可留意5:單商品可留倉2.則留倉2
						.text-danger 舉例說明:設台指今日損益為0每口留倉預扣為3萬,帳戶餘額為2萬+未平損益0.全商品可留意5:單商品可留意2,則留倉0
					li 商品最後交易日當天將全部強制平倉,不可留意。
					li 留倉規則採商品先收盤先留倉原則。
		.rules-item
			.rules-item__title 結帳規則
			.rules-item__content
				ul
					li 每日13:50,將停止所有交易動作,將自動刪除所有掛價單恢復帳號初始預設的「損失點]獲利點]。
					li 13:50系統將進行結帳指令,結帳時所有在倉單與留倉單將會以13:50:00第一筆報價,轉入新單,以計算今日損益。
					li 今日損益計算完後,系統將會把今日損益提列到帳戶餘額做相加减,查帳請至對帳表觀看。
					li 禮拜五13:50過後交易所產生的今日損益將與禮拜一系統13:50一起結帳。
		.rules-item
			.rules-item__title 結帳規則
			.rules-item__content
				ul
					li 全商品暫停交易待系統恢復方可繼續交易
					li 系統斷線期間斷線商品在倉部位如欲平倉睛與上層代理聯繫,如無來電平倉則繼續持有,待系統恢復再自行平倉
		.rules-item
			.rules-item__title 斷線處理
			.rules-item__content
				ul
					li 全商品暫停交易待系統恢復方可繼續交易
					li 系統斷線期間斷線商品在倉部位如欲平倉睛與上層代理聯繫,如無來電平倉則繼續持有,待系統恢復再自行平倉
		.rules-item
			.rules-item__title 聲明
			.rules-item__content
				ul
					li 因每家報價數據皆有些許誤差,如遇會員本身斷線、當機、塞車、電腦老舊.. 硬體或傳輸問題,則所有成交價格以「元氣理財教學系統(分價揭示)」為主。
					li 本係統為模擬教學用途,是一套免費的模擬教學程式,不論直接或間接因使用者個人行為造成任何型式之身心靈損失與本程式無關,皆不得要求賠償。
					li 本程式之金額為虛擬貨幣,用戶間不得贈與·轉售及交換,本係統有終止使用者之帳號密碼及連線之權利。
					li.text-danger 恆生晚整不收單,如會員下午盤留倉晚盤到早盤的風險請自行承擔!!!
</template>

<script>
import '@/assets/sass/style.scss'

export default {
	head() {
	  return {
	    htmlAttrs: {
	       class: this.$store.state.customStyle.htmlClass + ' rules'
	    }
	  }
	}
}
</script>